---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException
source: html/5f5f7309-449d-8a85-650c-b4f7eb59e1b1.htm
---
# RevitServerUnauthenticatedUserException Methods

Retrieves data needed to serialize the target object.